/* База данных  "Птицефабрика"*/

--Заполнение таблиц начальным набором данных 

--диета 
insert into Diets 
               (Number)
values 
      (1), -- 1
      (2), -- 2
      (3); -- 3
go
--породы кур 
insert into Breeds
         (BreedName, AverageEggsNumber, AverageWeight, IdDietNumber)
values 
      (N'Русская белая',           16, 1.8,1),  -- 1
      (N'Адлеровская серебристая', 14, 3.5,2),  -- 2
      (N'Загорская лососевая',     13, 2.7,3),  -- 3
      (N'Ереванская красная ',     15, 2.1,2),  -- 4
      (N'Кучинская юбилейная ',    13, 2.7,3),  -- 5
      (N'Пушкинская',              12, 2.5,1),  -- 6
      (N'Первомайская',            11, 2.3,3),  -- 7
      (N'Бресс Гальская',          12, 3.5,2);  -- 8
go


-- данные по курам
insert into Chickens 
         (IdBreed,  ChickenWeight, ChickenAge)
values 
   (7,3,4),  --1
  (2,2.2,8), --2
  (1,2.4,7), --3
  (4,1.7,15),--4
  (5,2.5,3), --5
  (6,3.3,8), --6
  (8,1.2,1), --7
  (5,1.4,6), --8
  (8,4.7,12),--9
  (2,1.3,21),--10
  (4,3.5,5), --11
  (8,2.6,6), --12
  (5,1.3,12),--13 
  (8,2.4,4), --14
  (2,2.7,22),--15
  (5,4.3,21),--16
  (5,1.5,6), --17
  (7,3.8,21),--18
  (2,1.4,20),--19
  (3,2.4,17),--20
  (3,3.6,9), --21
  (7,2.4,10),--22
  (7,3.7,4), --23
  (7,1.4,11),--24
  (3,2.5,24),--25
  (5,4.7,10),--26
  (2,2.5,9), --27
  (2,4.3,12),--28
  (5,3.8,18),--29
  (6,4.4,15),--30
  (4,2.3,15),--31
  (1,3.1,7), --32
  (7,1.3,20),--33
  (1,4.4,12),--34
  (7,2.3,23),--35
  (7,4.4,11),--36
  (3,4.5,22),--37
  (1,3.3,20),--38
  (5,3.3,9), --39
  (6,2.5,2), --40
  (1,2.3,21),--41
  (2,1.6,5), --42
  (6,2.4,20),--43
  (5,2.7,11),--44 
  (3,2.4,2), --45
  (4,3.8,4), --46
  (6,2.5,6), --47
  (8,4.7,14),--48
  (7,3.4,10),--49
  (5,2.7,17);--50
go


--цеха
insert into Workshop 
            (ShopName, NumberOfRows, NumberOfCages)
values 
      (N'Мясной', 100, 100 ),    --1
      (N'Мясо-яичные', 100, 100), --2
      (N'Несушки', 100, 100);     --3
go


--данные по работникам
insert into Workers 
          (IdWorkshop, Surname, [Name], Patronymic, Passport, Salary, Fired)
values 
       (1, N'Елагина',	    N'Ирина',	   N'Всеволодовна',  N'4573 489871',35570, 0), --1
       (2, N'Дубина',	    N'Кира',	   N'Никифоровна',   N'4177 361686',29387, 0), --2
       (3, N'Шастина',	    N'Ася',	       N'Ипполитовна',   N'4194 560450',50670, 0), --3
       (2, N'Борисюка',     N'Елизавета',  N'Сергеевна',     N'4734 139551',22210, 0), --4
       (1, N'Тарасов',	    N'Яков',	   N'Макарович',     N'4214 867745',31645, 0), --5
       (3, N'Сиянова',	    N'Катерина',   N'Вениаминовна',  N'4766 351832',27625, 0), --6
       (2, N'Сиянович',     N'Афанасий',   N'Кузьмич',       N'4640 634826',87521, 0), --7
       (1, N'Янцева',	    N'Анфиса',	   N'Валериановна',  N'4725 525722',44645, 0), --8
       (2, N'Ульянов',	    N'Никита',	   N'Макарович',     N'4223 737618',25089, 0), --9
       (1, N'Луковников',	N'Аркадий',	   N'Тимофеевич',    N'4879 753079',54225, 0), --10
       (3, N'Жаркин',	    N'Кузьма',	   N'Никифорович',   N'4430 508446',21344, 0), --11
       (2, N'Сарайкина',	N'Сюзанна',	   N'Алексеевна',    N'4674 506095',61744, 0), --12
       (1, N'Явчуновский',	N'Трофим',	   N'Ильич',         N'4067 344934',38705, 0), --13
       (2, N'Карасевич',	N'Николай',	   N'Вениаминович',  N'4185 887085',56009, 0), --14
       (3, N'Платущихина',  N'Полина',	   N'Ефимовна',      N'4948 975506',38776, 0), --15
       (2, N'Чернышёв',	    N'Виктор',	   N'Леонтьевич',    N'4786 565324',62024, 0), --16
       (1, N'Кузаева',	    N'Алина',	   N'Вениаминовна',  N'4274 854629',81083, 0), --17
       (3, N'Зворыгин',	    N'Игнат',	   N'Георгиевич',    N'4580 373848',16494, 0), --18
       (1, N'Цур',	        N'Леонтий',    N'Петрович',      N'4930 816218',55522, 0), --19
       (2, N'Сагадиев',	    N'Леонтий',	   N'Петрович',      N'4040 295525',29635, 0), --20
       (3, N'Белоконь',     N'Сюзанна',    N'Севастьяновна', N'4496 105327',59132, 0), --21
       (2, N'Хоботилов',    N'Антон',	   N'Вячеславович',  N'4971 242294',23729, 0), --22
       (1, N'Янкилович',	N'Гавриил',	   N'Евгеньевич',    N'4417 830884',60543, 0), --23
       (3, N'Густокашина',  N'Нонна',      N'Максимовна',    N'4490 825167',30515, 0), --24
       (2, N'Шмагин',	    N'Григорий',   N'Трофимович',    N'4394 124504',71880, 0), --25
       (1, N'Дмитровская',	N'Мила',	   N'Ефимовна',      N'4726 849543',17861, 0), --26
       (3, N'Карандашов',   N'Савва',	   N'Юринович',      N'4575 503159',65344, 0), --27
       (2, N'Кахманова',	N'Иван',	   N'Трофимович',    N'4962 267461',51444, 0), --28
       (1, N'Кондюрина',	N'Марианна',   N'Игнатьевна',    N'4476 172918',50847, 0), --29
       (3, N'Нутрихин',     N'Василий',    N'Алексеевич',    N'4489 913687',61690, 0), --30
       (2, N'Анюкова',	    N'Алена',	   N'Севастьяновна', N'4876 599516',46493, 0), --31
       (1, N'Ясинский',	    N'Емельян',	   N'Сергеевич',     N'4736 741895',31505, 0), --32
       (1, N'Березин',	    N'Тимофей',	   N'Игнатьевич',    N'4520 666849',26518, 0), --33
       (1, N'Живенкова',	N'Антонина',   N'Семеновна',     N'4098 258458',51652, 0), --34
       (2, N'Борцов',	    N'Тимофей',	   N'Петрович',      N'4498 104777',75359, 0), --35
       (3, N'Эрдели',	    N'Валентина',  N'Ефимовна',      N'4514 317146',55084, 0), --36
       (2, N'Яснова',	    N'Галина',	   N'Романовна',     N'4485 479595',31339, 0), --37
       (1, N'Бобра',	    N'Ульяна',	   N'Петровна',      N'4876 270434',65689, 0), --38
       (3, N'Седельников',	N'Роман',	   N'Павлович',      N'4367 424951',38324, 0), --39
       (2, N'Вотяков',	    N'Евгений',	   N'Артемович',     N'4874 135839',72448, 0), --40
       (3, N'Ходяева',	    N'Ульяна',	   N'Герасимовна',   N'4677 248331',80774, 0), --41
       (1, N'Басова',	    N'Зоя',	       N'Прокопьевна',   N'4561 949459',52008, 0), --42
       (2, N'Емельяненко',	N'Лариса',	   N'Севастьяновна', N'4332 226877',76769, 0), --43
       (3, N'Ёлшин',	    N'Федор',	   N'Николаевич',    N'4913 110856',37352, 0), --44
       (1, N'Терентьева',	N'Альбина',	   N'Ильишна',       N'4397 369061',25945, 0), --45
       (2, N'Бубнов',	    N'Дмитрий',	   N'Леонтьевич',    N'4363 182483',21239, 0), --46
       (3, N'Бархотов',	    N'Михаил',	   N'Романович',     N'4348 465884',37507, 0), --47
       (2, N'Яковенцева',	N'Юлиана',	   N'Кузьминовна',   N'4476 962119',67732, 0), --48
       (1, N'Плахтюрин',	N'Кирилл',	   N'Саввеевич',     N'4017 675427',37135, 0); --50      
go


-- данные по клетке 
insert into Cages
         (IdWorkshop, IdChicken, IdWorker, RowNumber, CageNumber)
values
  (3,15,30,7,7),
  (2,5,30,5,5),
  (2,26,27,7,6),
  (2,45,34,6,7),
  (2,12,34,1,2),
  (3,18,11,8,9),
  (3,39,2,4,3),
  (2,12,12,1,4),
  (3,42,48,5,4),
  (1,4,43,5,4),
  (3,4,34,7,2),
  (2,14,6,9,9),
  (1,49,21,7,9),
  (2,34,16,10,8),
  (2,7,13,6,10),
  (2,47,47,6,9),
  (2,8,21,1,6),
  (3,17,22,2,9),
  (2,5,7,2,6),
  (2,31,4,6,2),
  (2,14,16,8,3),
  (2,35,33,2,9),
  (2,19,12,6,8),
  (2,13,7,6,8),
  (3,48,42,4,9),
  (1,3,34,9,7),
  (2,2,11,2,8),
  (3,40,10,2,9),
  (2,11,23,7,10),
  (3,38,43,5,4),
  (2,45,12,3,1),
  (3,32,39,8,5),
  (2,1,11,2,8),
  (3,4,47,5,3),
  (2,25,29,1,8),
  (1,11,35,9,4),
  (2,36,16,9,8),
  (3,22,43,8,5),
  (1,18,27,10,3),
  (3,36,13,4,1),
  (1,47,42,9,7),
  (2,35,32,2,9),
  (3,10,43,9,4),
  (2,38,26,1,9),
  (3,22,3,4,2),
  (2,28,3,4,9),
  (2,14,24,2,7),
  (2,4,9,6,1),
  (2,8,45,6,3),
  (3,35,47,8,6);
go


  



insert into Production 
               (Id, [Data], NumberOfEggs)
values
       (1,'04/11/2021',8),
       (2,'04/04/2021',6),
       (3,'02/01/2022',8),
       (4,'11/26/2021',9),
       (5,'07/27/2021',2),
       (6,'05/03/2021',1),
       (7,'06/03/2021',7),
       (8,'04/01/2022',4),
       (9,'04/01/2021',5),
       (10,'08/22/2021',4),
       (11,'10/11/2021',2),
       (12,'03/12/2022',4),
       (13,'10/14/2021',8),
       (14,'11/05/2021',5),
       (15,'09/24/2021',4),
       (16,'03/20/2021',3),
       (17,'12/29/2021',5),
       (18,'12/22/2021',10),
       (19,'03/24/2021',5),
       (20,'05/04/2021',3),
       (21,'07/21/2021',8),
       (22,'06/22/2021',10),
       (23,'11/15/2021',3),
       (24,'03/15/2021',6),
       (25,'02/17/2022',7),
       (26,'07/07/2021',9),
       (27,'05/02/2021',3),
       (28,'07/15/2021',10),
       (29,'11/07/2021',10),
       (30,'11/17/2021',5),
       (31,'05/03/2021',2),
       (32,'03/20/2021',8),
       (33,'11/18/2021',6),
       (34,'01/11/2022',7),
       (35,'11/01/2021',6),
       (36,'01/29/2022',10),
       (37,'04/05/2022',1),
       (38,'04/12/2021',3),
       (39,'05/15/2021',3),
       (40,'09/03/2021',1),
       (41,'01/01/2022',6),
       (42,'08/07/2021',8),
       (43,'11/24/2021',5),
       (44,'03/22/2021',8),
       (45,'02/23/2022',3),
       (46,'05/16/2021',8),
       (47,'02/09/2022',8),
       (48,'07/01/2021',7),
       (49,'07/12/2021',3),
       (50,'04/02/2022',8);
  go




